Revit 2027 API
StickSymbolLocation Enumeration
 Indicates the stick symbol location on the UI, which is used for the BuiltInParameter STRUCTURAL_STICK_SYMBOL_LOCATION.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StickSymbolLocation
Public Enumeration StickSymbolLocation
public enum class StickSymbolLocation
type StickSymbolLocation
Members
Member name | Value | Description
StickViewBottom | 2
StickViewCenter | 0
StickViewLocLine | 3
StickViewTop | 1
See Also
Reference
Autodesk.Revit.DB Namespace